"Please Donate" = "Bitte spenden";
"Donate"="Spenden!";
"This is free software, but it still costs money to write, support, and distribute it. If you enjoy using it, please consider a donation to the authors of this software. It will help to make Cyberduck even better!" = "Die Entwicklung dieser Applikation hat mich manche lange Nacht gekostet. Wenn Sie an Cyberduck Gefallen finden, spenden Sie einen kleinen Beitrag, um die Weiterentwicklung zu ermöglichen. Es wird mich motivieren, Cyberduck weiter zu verbessern!";
"As a contributor to Cyberduck, you receive a registration key that disables this prompt." = "Wenn Sie die Entwicklung von Cyberduck unterstützen, erhalten Sie einen Schlüssel zum Ausblenden dieses Spendenaufrufs.";

"Thank you for using Cyberduck!" = "Danke für die Benutzung von Cyberduck!";

"Later" = "Später";

"Don't show again for this version." = "Für diese Version nicht mehr zeigen.";
"Registration Key" = "Spende-Schlüssel";

